### Import packages

In [1]:
import sqlite3
import pandas as pd

### Connect to database - there are two relevant tables ('author' and 'books')

In [2]:
conn = sqlite3.connect('amazon_db.db')
c = conn.cursor()

In [10]:
c.execute("""SELECT * FROM books
LIMIT 5; """)

In [11]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

                                books num_copies
0         A Elephant Ate Under A Fish    4226324
1         A Boy Jumped Outside A Lake    4048899
2       One Man Hopped Under The Tree     774329
3  A Person Threw Behind The Notebook    1359606
4     The Tree Ran Through A Mountain    4703380

In [12]:
c.execute("""SELECT * FROM author
LIMIT 5; """);

In [13]:
df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df

             author                                book
0      David Taylor         A Guy Dove Outside The Desk
1    Sidney Osborne        A Fish Hopped Through A Lake
2     Robert Martin     The Woman Winced Outside A Desk
3      Greg Simpson  A Banana Winced Outside The Banana
4  Edgar Williamson      A Person Ate Behind The Potato

### Use SQL to answer the following questions:

1. How many rows are in the 'author' table? 

2. How many authors have the first name 'David'?  

3. How many books did each author write? 

4. Use both the author table and books table to answer: how many copies were sold by authors named David 


    a. how many copies for each of the Davids
    
    
    b. how many copies in total for all Davids